// исходный текст программы сохранен в кодировке UTF-8 без BOM

// calc-implementation-step1.cpp
// пример наметки (наброска) функции main программы на шаге 1 реализации
// для задачи «Калькулятор»

int main()
{
    // получить первое число от пользователя
    // getUserInput();

    // получить математическую операцию от пользователя
    // getMathematicalOperation();

    // получить второе число от пользователя
    // getUserInput();

    // вычислить результат
    // calculateResult();

    // вывести результат в консоль
    // printResult();

    return 0;
}