// исходный текст программы сохранен в кодировке UTF-8 без BOM

// add.h
// один из файлов многофайловой программы, заголовочный файл, содержащий
// объявления функций, определенных в файле add.cpp

// 1) Мы должны написать здесь защиту от дублирующих подключений (header guard),
// но мы пока опустим ее для простоты (мы рассмотрим смысл этой защиты в
// следующем уроке).

// 2) Тут начинается содержимое данного заголовочного файла, то есть место,
// в котором мы описываем объявления.

int add(int x, int y); // прототип функции — не забудьте точку с запятой!