// исходный текст программы сохранен в кодировке UTF-8 без BOM

// main-step2.cpp
// решение задачи вопроса 1 проверочного опроса к подглаве 2.x
// шаг 2: наметка прототипов функций для пунктов плана решения задачи

int main()
{
    // получить первое целое число от пользователя
    // int readNumber();

    // получить второе целое число от пользователя
    // int readNumber();

    // сложить два целых числа и получить результат

    // вывести результат сложения в консоль
    // void writeAnswer(int);

    return 0;
}