// исходный текст программы сохранен в кодировке UTF-8 без BOM

// commenting-out.cpp
// закомментирование и раскомментирование кода

#include <iostream>

int main()
{
    // закомментирование / раскомментирование строки кода в редакторе «VS Code»:
    // поставить курсор на нужную строку и нажать Ctrl+/

    std::cout << 1;
    // std::cout << 1;

    // закомментирование / раскомментирование блока кода в редакторе «VS Code»:
    // выделить несколько строк и нажать Ctrl+/

    std::cout << 1;
    std::cout << 2;
    std::cout << 3;

    // std::cout << 1;
    // std::cout << 2;
    // std::cout << 3;

    // закомментирование / раскомментирование блока кода в редакторе «VS Code»:
    // выделить блок кода и нажать Shift+Alt+A

/* 
    std::cout << 1;
    std::cout << 2;
    std::cout << 3;
 */

    return 0;
}